SGLang_Data_20260609/sglang-oai_real_rr8_il2048_ol128.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=30002, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='real_pd_sweep_20260609/sglang-oai_real_rr8_il2048_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=30002, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=8.0, use_trace_timestamps=False, max_concurrency=None, output_file='real_pd_sweep_20260609/sglang-oai_real_rr8_il2048_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 202736
#Output tokens: 13323
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    8.0       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  26.03     
Total input tokens:                      202736    
Total input text tokens:                 202736    
Total input vision tokens:               0         
Total generated tokens:                  13323     
Total generated tokens (retokenized):    13317     
Request throughput (req/s):              7.68      
Input token throughput (tok/s):          7789.27   
Output token throughput (tok/s):         511.88    
Peak output token throughput (tok/s):    878.00    
Peak concurrent requests:                24        
Total token throughput (tok/s):          8301.15   
Concurrency:                             7.12      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   926.95    
Median E2E Latency (ms):                 937.44    
---------------Time to First Token----------------
Mean TTFT (ms):                          82.99     
Median TTFT (ms):                        78.19     
P99 TTFT (ms):                           147.53    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.96     
Median TPOT (ms):                        12.92     
P99 TPOT (ms):                           15.19     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           12.86     
Median ITL (ms):                         12.74     
P95 ITL (ms):                            15.91     
P99 ITL (ms):                            24.55     
Max ITL (ms):                            36.01     
==================================================